bin/artillery-draw.yml
# Artillery installed as part of npm development requirements
# Usage (note lack of trailing / on the URL):
#   (setup 88-team BP tournament; enable public info; release R1 draw & motions)
#   (restart dynos on heroku)
#   $ artillery run bin/artillery-draw.yml --target https://tc-test-b.herokuapp.com
# Testing Environment:
#   DEBUG=0
#   PUBLIC_FAST_CACHE_TIMEOUT=30
#   PUBLIC_SLOW_CACHE_TIMEOUT=30
#   TAB_PAGES_CACHE_TIMEOUT=30
#   SCOUT_MONITOR=false

config:
  target: 'https://tabbycatdevelop.herokuapp.com'
  http:
    timeout: 35 # Responses returned in 30 seconds or request is aborted
  phases:
    - duration: 30
      arrivalRate: 0
      name: "Wait for cache to expire"
    - duration: 480
      arrivalRate: 9
      rampTo: 18
      name: "Load test ramping to 14rps over 10 minutes"
    - duration: 120
      arrivalRate: 18
      name: "Maintain load test maximum over 2 minutes"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "Load main draw page"
    weight: 6
    flow:
    - get:
        url: "/bp88team/draw/"
  - name: "Load motions occasionally"
    weight: 2
    flow:
    - get:
        url: "/bp88team/motions/"
  - name: "Load home occasionally"
    weight: 2
    flow:
    - get:
        url: "/bp88team/"