bin/artillery-draw.yml
# Artillery installed as part of npm development requirements
# Usage:
#   (setup 88-team BP tournament; enable public info; release R1 draw & motions)
#   (restart dynos on heroku)
#   $ artillery run bin/artillery-draw.yml
# Testing Environment:
#   DEBUG=0
#   PUBLIC_FAST_CACHE_TIMEOUT=60
#   PUBLIC_SLOW_CACHE_TIMEOUT=60
#   TAB_PAGES_CACHE_TIMEOUT=60
#   SCOUT_MONITOR=true


# duration = time of each phase
# arrival rate = number of virtual users per second
# scenarios are probababilistic; weight control relative chance

config:
  target: 'https://tabbycatdevelop.herokuapp.com'
  phases:
    - duration: 60
      arrivalRate: 0
      name: "Wait for cache to expire"
    - duration: 200
      arrivalRate: 0.5
      name: "Significant load test over two cache regens"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "Thing being tested"
    weight: 5
    flow:
    - get:
        url: "/bp88team/draw"
  - name: "Hit other pages also; draw"
    weight: 1
    flow:
    - get:
        url: "/bp88team/motions"
  - name: "Hit other pages also; home"
    weight: 1
    flow:
    - get:
        url: "/bp88team"

# Results
#   18-08-01         1 Hobby Dyno           arrival rate of 0.5
#               2175 median latency    9986 max latency    9009 p95
#               2100 median latency    5016 max latency    4467 p95